---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.EndExtension
source: html/dd65c986-1c01-c3c0-d824-819f9f96e645.htm
---
# Autodesk.Revit.DB.ParameterTypeId.EndExtension Property

"End Extension"

## Syntax (C#)
```csharp
public static ForgeTypeId EndExtension { get; }
```